## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| update   | `module.gha_vpn.aws_acm_certificate.client_vpn[0]`                 |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |
| recreate | `aws_secretsmanager_secret_version.gha_vpn_cert`                   |
|          | `module.gha_vpn.tls_self_signed_cert.client_vpn[0]`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.gha_vpn_cert must be replaced
-/+ resource "aws_secretsmanager_secret_version" "gha_vpn_cert" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:GHA_VPN_CERT-XuSUCo" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:GHA_VPN_CERT-XuSUCo|terraform-20240626174023904700000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20240626174023904700000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.gha_vpn.aws_acm_certificate.client_vpn[0] will be updated in-place
  ~ resource "aws_acm_certificate" "client_vpn" {
      ~ certificate_body          = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDSTCCAjGgAwIBAgIQbHviHrElEDTcLVOLwURlwzANBgkqhkiG9w0BAQsFADA4
            MSEwHwYDVQQKExhDYW5hZGlhbiBEaWdpdGFsIFNlcnZpY2UxEzARBgNVBAMTCmNk
            cy1zbmMuY2EwHhcNMjQwNjI0MTMyNTM3WhcNMjUwNjI0MTMyNTM3WjA4MSEwHwYD
            VQQKExhDYW5hZGlhbiBEaWdpdGFsIFNlcnZpY2UxEzARBgNVBAMTCmNkcy1zbmMu
            Y2EwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDZ2iuvGVfmfwyauNHa
            M0g87mgy4JeTbKpGVujgkuXl7zaFVo6/Su8feHmjwtFVQ/8/dcEVA14mSK5n6q97
            l6l72LrFfUUu/BnUHpZlLh03lVwPFyEsw8O6dOH2k1CwAUA+reGPqa+6Nd1+5dhi
            EF0fH+JoV+Z3fW1g3PpTq+6B5Ag8WpONVpTlwgDYiXD/wHYCMtWL9/TTq5KYqfFT
            IpHsHxbi+mPmMFZktAsCTXPARlnnUGuccX4+5ytbFuMgDH2hQke04ytxjLh/8mnJ
            CCnfaFjfb/a4TlhucbMPHZDk6wa5ravp/V3KLjqdaWssJHhx7cH4ndJWllwRh/QO
            IdtxAgMBAAGjTzBNMA4GA1UdDwEB/wQEAwICpDAtBgNVHSUEJjAkBggrBgEFBQcD
            AQYIKwYBBQUHAwUGCCsGAQUFBwMGBgRVHSUAMAwGA1UdEwEB/wQCMAAwDQYJKoZI
            hvcNAQELBQADggEBAFOHoB2wDj+y6HVy1hs48TfDWF2+02Zfl1ieiGaPGJYvFEoS
            gjhl1ZKkKiHxqw52Z6sWbFRQnNBE45ADD3BgZZV7ImNEl7QeTi9IIi5Wde5GlQE4
            Y8jGoWWb0O+Qb4o+br7G4qEog8S/W1d8VF+CuuYDY15kQZTd4Tc0YMVbWkJK1vsL
            Y4wYKdhzs9wSnWyp9WrmL0CaYJML76ziTw4A1AKU0/sfmhwgAIHRHFGKgnUVHi6a
            ZzeY9zCWSiMkhtZmIrlPPdE72HUkFWfnnnA4HwAqeca3/j+oFB+Csm/8OntxnY+/
            +mXKgGuO7Ua3hQ4FzZMzA/WIoq5gUDNGLuQOPIc=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
        id                        = "arn:aws:acm:ca-central-1:239043911459:certificate/953e366f-681b-490e-b9ee-01938b2f032d"
        tags                      = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gha_vpn.tls_self_signed_cert.client_vpn[0] must be replaced
-/+ resource "tls_self_signed_cert" "client_vpn" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDSTCCAjGgAwIBAgIQbHviHrElEDTcLVOLwURlwzANBgkqhkiG9w0BAQsFADA4
            MSEwHwYDVQQKExhDYW5hZGlhbiBEaWdpdGFsIFNlcnZpY2UxEzARBgNVBAMTCmNk
            cy1zbmMuY2EwHhcNMjQwNjI0MTMyNTM3WhcNMjUwNjI0MTMyNTM3WjA4MSEwHwYD
            VQQKExhDYW5hZGlhbiBEaWdpdGFsIFNlcnZpY2UxEzARBgNVBAMTCmNkcy1zbmMu
            Y2EwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDZ2iuvGVfmfwyauNHa
            M0g87mgy4JeTbKpGVujgkuXl7zaFVo6/Su8feHmjwtFVQ/8/dcEVA14mSK5n6q97
            l6l72LrFfUUu/BnUHpZlLh03lVwPFyEsw8O6dOH2k1CwAUA+reGPqa+6Nd1+5dhi
            EF0fH+JoV+Z3fW1g3PpTq+6B5Ag8WpONVpTlwgDYiXD/wHYCMtWL9/TTq5KYqfFT
            IpHsHxbi+mPmMFZktAsCTXPARlnnUGuccX4+5ytbFuMgDH2hQke04ytxjLh/8mnJ
            CCnfaFjfb/a4TlhucbMPHZDk6wa5ravp/V3KLjqdaWssJHhx7cH4ndJWllwRh/QO
            IdtxAgMBAAGjTzBNMA4GA1UdDwEB/wQEAwICpDAtBgNVHSUEJjAkBggrBgEFBQcD
            AQYIKwYBBQUHAwUGCCsGAQUFBwMGBgRVHSUAMAwGA1UdEwEB/wQCMAAwDQYJKoZI
            hvcNAQELBQADggEBAFOHoB2wDj+y6HVy1hs48TfDWF2+02Zfl1ieiGaPGJYvFEoS
            gjhl1ZKkKiHxqw52Z6sWbFRQnNBE45ADD3BgZZV7ImNEl7QeTi9IIi5Wde5GlQE4
            Y8jGoWWb0O+Qb4o+br7G4qEog8S/W1d8VF+CuuYDY15kQZTd4Tc0YMVbWkJK1vsL
            Y4wYKdhzs9wSnWyp9WrmL0CaYJML76ziTw4A1AKU0/sfmhwgAIHRHFGKgnUVHi6a
            ZzeY9zCWSiMkhtZmIrlPPdE72HUkFWfnnnA4HwAqeca3/j+oFB+Csm/8OntxnY+/
            +mXKgGuO7Ua3hQ4FzZMzA/WIoq5gUDNGLuQOPIc=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ early_renewal_hours   = 0 -> 672
      ~ id                    = "144199862314609652304030018556855084483" -> (known after apply)
      ~ key_algorithm         = "RSA" -> (known after apply)
      ~ ready_for_renewal     = true -> false # forces replacement
      ~ validity_end_time     = "2025-06-24T13:25:37.424186232Z" -> (known after apply)
      ~ validity_start_time   = "2024-06-24T13:25:37.424186232Z" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ (sensitive value),
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ gha_vpn_certificate                       = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
